In [1]:
import pandas as pd

In [2]:
df1 = pd.read_csv(r'C:\Users\User\Desktop\Final Year Project\HKO Raw Data\aware\aware_2RS.csv')
df2 = pd.read_csv(r'C:\Users\User\Desktop\Final Year Project\HKO Raw Data\aware\aware_I2RS_0.csv')
df3 = pd.read_csv(r'C:\Users\User\Desktop\Final Year Project\HKO Raw Data\aware\aware_I2RS_1.csv')
df4 = pd.read_csv(r'C:\Users\User\Desktop\Final Year Project\HKO Raw Data\aware\aware_RR.csv')

In [3]:
# Convert the 'DATETIME' column in each DataFrame to datetime objects
df1['DATETIME'] = pd.to_datetime(df1['DATETIME']).dt.tz_convert(None)
df2['DATETIME'] = pd.to_datetime(df2['DATETIME']).dt.tz_convert(None)
df3['DATETIME'] = pd.to_datetime(df3['DATETIME']).dt.tz_convert(None)
df4['DATETIME'] = pd.to_datetime(df4['DATETIME']).dt.tz_convert(None)

In [4]:
# Step 2: Concatenate the DataFrames.
# Assuming they all have the same columns and you want to concatenate by rows.
concatenated_df = pd.concat([df1, df2, df3, df4], ignore_index=True)

In [5]:
concatenated_df

                  DATETIME CORRIDOR_3RS CORRIDOR_2RS  MAGNITUDE LOCATION
0      2018-01-03 11:49:51         07CA         07LA         15      2MF
1      2018-01-03 11:49:51         25CD         25RD         15      2MD
2      2018-01-04 14:15:41         07RA         07RA        -15      1MF
3      2018-01-04 14:15:41         25LD         25LD        -15      1MD
4      2018-01-04 14:16:21         07RA         07RA         15      1MF
...                    ...          ...          ...        ...      ...
703499 2022-07-06 07:57:41         25CD         25RD         15      RWY
703500 2022-07-06 21:53:21         07RA         07RA         15      RWY
703501 2022-07-06 21:53:21         07RD         07RD         15      RWY
703502 2022-07-06 21:53:21         25LA         25LA         15      RWY
703503 2022-07-06 21:53:21         25LD         25LD         15      RWY

[703504 rows x 5 columns]

In [6]:
# Step 3: Export the concatenated DataFrame to an Excel file.
# You might want to specify an encoding if you have special characters.
concatenated_df.to_excel(r'C:\Users\User\Desktop\Final Year Project\Code\Processed_HKO\aware\HKO_aware_concatenated_data.xlsx', index=False)